
public class mainMethod {

	public static void main(String[] args){
		
		/*
		  (1)메인메서드
		 
		 	main() : 기본 메서드
		 			= 자바 프로그램이 실행되면 가장 먼저 메인 메서드를 찾아서 실행
		 			= 길게 작성된 소스에서 그 프로그램의 시작이 어디인지를 알려주는 용도
		 			= entry poin
		 
		  (2)파라미터스
		  
		  	메서드(함수)호출 시 하나or둘 이상의 파라미터 값을 넣어서 호출할 수 있음
		  	
		  			= 인수(파라미터)들의 값을 저장할 변수(바구니)들을 명시
		  			= String -> 문자열 -> []배열(바구니) -> args -> argument(논의,논쟁,언쟁,말타툼,주장//;인수,인자,독립변수)
		  			
		  (3)반활할 타입
		  
		  			return type = 반환할 값의 유무 -> 없으면 void(빈 공간,공허함,empty)
		  			= 이 메서드(함수)는 호출하면 결과로써 특별히 반환되는 값은 없이 수행되는 메서드
		 		
		 */
		
	}
	
}
